IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G2_EPWM27_CONTROLSS_G2_EPWM27.xml
	<register id="CONTROLSS_G2_EPWM27_TZCBCFLG" acronym="CONTROLSS_G2_EPWM27_TZCBCFLG" offset="0x128" width="16" description="Trip Zone CBC Flag Register">
		<bitfield id="CAPEVT" width="1" begin="8" end="8" resetval="0x0" description="Latched Status Flag for Capture Event   0: Indicates no trip event has occurred on CAPEVT  1: Indicates a trip event has occurred for the event defined for CAPEVT" range="8" rwaccess="R"/> 
		<bitfield id="DCBEVT2" width="1" begin="7" end="7" resetval="0x0" description="Latched Status Flag for Digital Compare B Output Event 2 Trip Latch   0: Reading a 0 indicates that no trip has occurred on DCBEVT2.  1: Reading a 1 indicates a trip has occured on the DCBEVT2 selected event." range="7" rwaccess="R"/> 
		<bitfield id="DCAEVT2" width="1" begin="6" end="6" resetval="0x0" description="Latched Status Flag for Digital Compare A Output Event 2 Trip Latch   0: Reading a 0 indicates that no trip has occurred on DCAEVT2.  1: Reading a 1 indicates a trip has occured on the DCAEVT2 selected event." range="6" rwaccess="R"/> 
		<bitfield id="CBC6" width="1" begin="5" end="5" resetval="0x0" description="Latched Status Flag for CBC6 Trip Latch   0: Reading a 0 indicates that no trip has occurred on CBC6.  1: Reading a 1 indicates a trip has occured on the CBC6 selected event." range="5" rwaccess="R"/> 
		<bitfield id="CBC5" width="1" begin="4" end="4" resetval="0x0" description="Latched Status Flag for CBC5 Trip Latch   0: Reading a 0 indicates that no trip has occurred on CBC5.  1: Reading a 1 indicates a trip has occured on the CBC5 selected event." range="4" rwaccess="R"/> 
		<bitfield id="CBC4" width="1" begin="3" end="3" resetval="0x0" description="Latched Status Flag for CBC4 Trip Latch   0: Reading a 0 indicates that no trip has occurred on CBC4.  1: Reading a 1 indicates a trip has occured on the CBC4 selected event." range="3" rwaccess="R"/> 
		<bitfield id="CBC3" width="1" begin="2" end="2" resetval="0x0" description="Latched Status Flag for CBC3 Trip Latch   0: Reading a 0 indicates that no trip has occurred on CBC3.  1: Reading a 1 indicates a trip has occured on the CBC3 selected event." range="2" rwaccess="R"/> 
		<bitfield id="CBC2" width="1" begin="1" end="1" resetval="0x0" description="Latched Status Flag for CBC2 Trip Latch   0: Reading a 0 indicates that no trip has occurred on CBC2.  1: Reading a 1 indicates a trip has occured on the CBC2 selected event." range="1" rwaccess="R"/> 
		<bitfield id="CBC1" width="1" begin="0" end="0" resetval="0x0" description="Latched Status Flag for CBC1 Trip Latch   0: Reading a 0 indicates that no trip has occurred on CBC1.  1: Reading a 1 indicates a trip has occured on the CBC1 selected event." range="0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G2_EPWM27_TZOSTFLG" acronym="CONTROLSS_G2_EPWM27_TZOSTFLG" offset="0x12A" width="16" description="Trip Zone OST Flag Register">
		<bitfield id="CAPEVT" width="1" begin="8" end="8" resetval="0x0" description="Latched Status Flag for Capture Event   0: Indicates no trip event has occurred on CAPEVT  1: Indicates a trip event has occurred for the event defined for CAPEVT" range="8" rwaccess="R"/> 
		<bitfield id="DCBEVT1" width="1" begin="7" end="7" resetval="0x0" description="Latched Status Flag for Digital Compare B Output Event 1 Trip Latch   0: Reading a 0 indicates that no trip has occurred on DCBEVT1.  1: Reading a 1 indicates a trip has occured on the DCBEVT1 selected event." range="7" rwaccess="R"/> 
		<bitfield id="DCAEVT1" width="1" begin="6" end="6" resetval="0x0" description="Latched Status Flag for Digital Compare A Output Event 1 Trip Latch   0: Reading a 0 indicates that no trip has occurred on DCAEVT1.  1: Reading a 1 indicates a trip has occured on the DCAEVT1 selected event." range="6" rwaccess="R"/> 
		<bitfield id="OST6" width="1" begin="5" end="5" resetval="0x0" description="Latched Status Flag for OST6 Trip Latch   0: Reading a 0 indicates that no trip has occurred on OST6.  1: Reading a 1 indicates a trip has occured on the OST6 selected event." range="5" rwaccess="R"/> 
		<bitfield id="OST5" width="1" begin="4" end="4" resetval="0x0" description="Latched Status Flag for OST5 Trip Latch   0: Reading a 0 indicates that no trip has occurred on OST5.  1: Reading a 1 indicates a trip has occured on the OST5 selected event." range="4" rwaccess="R"/> 
		<bitfield id="OST4" width="1" begin="3" end="3" resetval="0x0" description="Latched Status Flag for OST4 Trip Latch   0: Reading a 0 indicates that no trip has occurred on OST4.  1: Reading a 1 indicates a trip has occured on the OST4 selected event." range="3" rwaccess="R"/> 
		<bitfield id="OST3" width="1" begin="2" end="2" resetval="0x0" description="Latched Status Flag for OST3 Trip Latch   0: Reading a 0 indicates that no trip has occurred on OST3.  1: Reading a 1 indicates a trip has occured on the OST3 selected event." range="2" rwaccess="R"/> 
		<bitfield id="OST2" width="1" begin="1" end="1" resetval="0x0" description="Latched Status Flag for OST2 Trip Latch   0: Reading a 0 indicates that no trip has occurred on OST2.  1: Reading a 1 indicates a trip has occured on the OST2 selected event." range="1" rwaccess="R"/> 
		<bitfield id="OST1" width="1" begin="0" end="0" resetval="0x0" description="Latched Status Flag for OST1 Trip Latch   0: Reading a 0 indicates that no trip has occurred on OST1.  1: Reading a 1 indicates a trip has occured on the OST1 selected event." range="0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G2_EPWM27_TZCLR" acronym="CONTROLSS_G2_EPWM27_TZCLR" offset="0x12E" width="16" description="Trip Zone Clear Register">
		<bitfield id="CBCPULSE" width="2" begin="15" end="14" resetval="0x0" description="Clear Pulse for Cycle-By-Cycle [CBC] Trip Latch  This bit field determines which pulse clears the CBC trip latch.   00: CTR = zero pulse clears CBC trip latch. [Same as legacy designs.]  01: CTR = PRD pulse clears CBC trip latch.  10: CTR = zero or CTR = PRD pulse clears CBC trip latch.  11: CBC trip latch is not cleared" range="15 - 14" rwaccess="R/W"/> 
		<bitfield id="CAPEVT" width="1" begin="7" end="7" resetval="0x0" description="Clear Flag for Capture Event   0: Writing 0 has no effect. This bit always reads back 0.  1: Writing 1 clears the CAPEVT event trip condition." range="7" rwaccess="R/W1TS"/> 
		<bitfield id="DCBEVT2" width="1" begin="6" end="6" resetval="0x0" description="Clear Flag for Digital Compare Output B Event 2   0: Writing 0 has no effect. This bit always reads back 0.  1: Writing 1 clears the DCBEVT2 event trip condition." range="6" rwaccess="R/W1TS"/> 
		<bitfield id="DCBEVT1" width="1" begin="5" end="5" resetval="0x0" description="Clear Flag for Digital Compare Output B Event 1   0: Writing 0 has no effect. This bit always reads back 0.  1: Writing 1 clears the DCBEVT1 event trip condition." range="5" rwaccess="R/W1TS"/> 
		<bitfield id="DCAEVT2" width="1" begin="4" end="4" resetval="0x0" description="Clear Flag for Digital Compare Output A Event 2   0: Writing 0 has no effect. This bit always reads back 0.  1: Writing 1 clears the DCAEVT2 event trip condition." range="4" rwaccess="R/W1TS"/> 
		<bitfield id="DCAEVT1" width="1" begin="3" end="3" resetval="0x0" description="Clear Flag for Digital Compare Output A Event 1   0: Writing 0 has no effect. This bit always reads back 0.  1: Writing 1 clears the DCAEVT1 event trip condition." range="3" rwaccess="R/W1TS"/> 
		<bitfield id="OST" width="1" begin="2" end="2" resetval="0x0" description="Clear Flag for One-Shot Trip [OST] Latch   0: Has no effect. Always reads back a 0.  1: Clears this Trip [set] condition." range="2" rwaccess="R/W1TS"/> 
		<bitfield id="CBC" width="1" begin="1" end="1" resetval="0x0" description="Clear Flag for Cycle-By-Cycle [CBC] Trip Latch   0: Has no effect. Always reads back a 0.  1: Clears this Trip [set] condition." range="1" rwaccess="R/W1TS"/> 
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="Global Interrupt Clear Flag   0: Has no effect. Always reads back a 0.  1: Clears the trip-interrupt flag for this ePWM module [TZFLG[INT]].  NOTE: No further EPWMx_TZINT PIE interrupts will be generated until the flag is cleared. If the TZFLG[INT] bit is cleared and any of the other flag bits are set, then another interrupt pulse will be generated. Clearing all flag bits will prevent further interrupts." range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CONTROLSS_G2_EPWM27_TZCBCCLR" acronym="CONTROLSS_G2_EPWM27_TZCBCCLR" offset="0x130" width="16" description="Trip Zone CBC Clear Register">
		<bitfield id="CAPEVT" width="1" begin="8" end="8" resetval="0x0" description="Clear Flag for CAPEVT selected for CBC   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZCBCFLG[CAPEVT] bit." range="8" rwaccess="R/W1TS"/> 
		<bitfield id="DCBEVT2" width="1" begin="7" end="7" resetval="0x0" description="Clear Flag for Digital Compare Output B Event 2 selected for CBC   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZCBCFLG[DCBEVT2] bit." range="7" rwaccess="R/W1TS"/> 
		<bitfield id="DCAEVT2" width="1" begin="6" end="6" resetval="0x0" description="Clear Flag for Digital Compare Output A Event 2 selected for CBC   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZCBCFLG[DCAEVT2] bit." range="6" rwaccess="R/W1TS"/> 
		<bitfield id="CBC6" width="1" begin="5" end="5" resetval="0x0" description="Clear Flag for Cycle-By-Cycle [CBC6] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZCBCFLG[CBC6] bit." range="5" rwaccess="R/W1TS"/> 
		<bitfield id="CBC5" width="1" begin="4" end="4" resetval="0x0" description="Clear Flag for Cycle-By-Cycle [CBC5] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZCBCFLG[CBC5] bit." range="4" rwaccess="R/W1TS"/> 
		<bitfield id="CBC4" width="1" begin="3" end="3" resetval="0x0" description="Clear Flag for Cycle-By-Cycle [CBC4] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZCBCFLG[CBC4] bit." range="3" rwaccess="R/W1TS"/> 
		<bitfield id="CBC3" width="1" begin="2" end="2" resetval="0x0" description="Clear Flag for Cycle-By-Cycle [CBC3] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZCBCFLG[CBC3] bit." range="2" rwaccess="R/W1TS"/> 
		<bitfield id="CBC2" width="1" begin="1" end="1" resetval="0x0" description="Clear Flag for Cycle-By-Cycle [CBC2] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZCBCFLG[CBC2] bit." range="1" rwaccess="R/W1TS"/> 
		<bitfield id="CBC1" width="1" begin="0" end="0" resetval="0x0" description="Clear Flag for Cycle-By-Cycle [CBC1] Trip Latch   0: Writing a 0 has no effect.  1: Writing a 1 will clear the TZCBCFLG[CBC1] bit." range="0" rwaccess="R/W1TS"/>
	</register>
